package Day09.Task1;

/**
 * Создайте класс Человек (англ. Human). У человека должно быть поле "имя" (англ. name).
 * На это поле в классе должен быть конструктор, геттер и сеттер.
 * printInfo():
 * "Этот человек с именем ИМЯ",
 * Класс Студент (англ. Student), который наследуется от класса Человек.
 * У студента есть дополнительное строковое поле - название его учебной группы.
 * Для этого поля тоже необходимо создать геттер и сеттер.
 * Конструктор в классе Студент должен принимать на вход два аргумента - имя и название учебной группы.
 * printInfo():
 * "Этот человек с именем ИМЯ"
 * "Этот студент с именем ИМЯ"
 * I
 * Класс Преподаватель должен тоже наследоваться от класса Человек.
 * При этом, у преподавателя есть дополнительное строковое поле - название предмета,
 * который ведет этот преподаватель. Для этого поля необходимо создать геттер и сеттер.
 * Конструктор в классе Преподаватель должен принимать на вход два аргумента - имя преподавателя и название предмета
 * printInfo():
 * "Этот человек с именем ИМЯ"
 * "Этот преподаватель с именем ИМЯ".
 * Создайте в методе main() объект класса Студент и объект класса Преподаватель.
 * Выведите в консоль название учебной группы у объекта-студента и название предмета у объекта-преподавателя.
 * Затем, вызовите printInfo() на объектах и посмотрите на результат.
 */

public class Task01 {
}
